{
    "Call on Ancient Blood": {
        "type": "Reaction",
        "name": "Ancient-Blooded Dwarf",
        "traits": [],
        "cost": "",
        "requirement": "",
        "trigger": "You attempt a saving throw against a magical effect, but you haven't rolled yet.",
        "description": "Dwarven heroes of old could shrug off their enemies’ magic, and some of that resistance manifests in you. You gain the Call on Ancient Blood reaction."
    },
    "Attack of Opportunity": {
        "type": "Reaction",
        "name": "Attack of Opportunity",
        "traits": [],
        "cost": "",
        "requirement": "",
        "trigger": "A creature within your reach uses a manipulate action or a move action, makes a ranged attack, or leaves a square during a move action it’s using.",
        "description": "You lash out at a foe that leaves an opening. Make a melee Strike against the triggering creature. If your attack is a critical hit and the trigger was a manipulate action, you disrupt that action. This Strike doesn’t count toward your multiple attack penalty, and your multiple attack penalty doesn’t apply to this Strike."
    },
    "Quick Alchemy": {
        "type": "1AP",
        "name": "Quick Alchemy",
        "traits": [
            "Alchemist",
            "Manipulate"
        ],
        "cost": "1 batch of infused reagents",
        "requirement": "You have alchemist’s tools (page 287), the formula for the alchemical item you’re creating, and a free hand.",
        "trigger": "",
        "description": "You swiftly mix up a short-lived alchemical item to use at a moment’s notice. You create a single alchemical item of your advanced alchemy level or lower that’s in your formula book without having to spend the normal monetary cost in alchemical reagents or needing to attempt a Crafting check. This item has the infused trait, but it remains potent only until the start of your next turn."
    },
    "Quick Bomber": {
        "type": "1AP",
        "name": "Quick Bomber",
        "traits": [
            "Alchemist"
        ],
        "cost": "",
        "requirement": "",
        "trigger": "",
        "description": "You keep your bombs in easy-to-reach pouches from which you draw without thinking. You Interact to draw a bomb, then Strike with it."
    },
    "Double Slice": {
        "type": "2AP",
        "name": "Double Slice",
        "traits": [
            "Fighter"
        ],
        "cost": "",
        "requirement": "You are wielding two melee weapons, each in a different hand.",
        "trigger": "",
        "description": "You lash out at your foe with both weapons. Make two Strikes, one with each of your two melee weapons, each using your current multiple attack penalty. Both Strikes must have the same target. If the second Strike is made with a weapon that doesn’t have the agile trait, it takes a –2 penalty. If both attacks hit, combine their damage, and then add any other applicable effects from both weapons. You add any precision damage only once, to the attack of your choice. Combine the damage from both Strikes and apply resistances and weaknesses only once. This counts as two attacks when calculating your multiple attack penalty."
    },
    "Exacting Strike": {
        "type": "1AP",
        "name": "Exacting Strike",
        "traits": [
            "Fighter",
            "Press"
        ],
        "cost": "",
        "requirement": "",
        "trigger": "",
        "description": "You make a controlled attack, fully accounting for your momentum. Make a Strike. The Strike gains the following failure effect.",
        "failure": "This attack does not count toward your multiple attack penalty."
    },
    "Point-Blank Shot": {
        "type": "1AP",
        "name": "Point-Blank Shot",
        "traits": [
            "Fighter",
            "Open",
            "Stance"
        ],
        "cost": "",
        "requirement": "You are wielding a ranged weapon.",
        "trigger": "",
        "description": "You take aim to pick off nearby enemies quickly. When using a ranged volley weapon while you are in this stance, you don’t take the penalty to your attack rolls from the volley trait. When using a ranged weapon that doesn’t have the volley trait, you gain a +2 circumstance bonus to damage rolls on attacks against targets within the weapon’s first range increment.",
        "failure": ""
    },
    "Power Attack": {
        "type": "2AP",
        "name": "Power Attack",
        "traits": [
            "Fighter",
            "Flourish"
        ],
        "cost": "",
        "requirement": "",
        "trigger": "",
        "description": "You unleash a particularly powerful attack that clobbers your foe but leaves you a bit unsteady. Make a melee Strike. This counts as two attacks when calculating your multiple attack penalty. If this Strike hits, you deal an extra die of weapon damage. If you’re at least 10th level, increase this to two extra dice, and if you’re at least 18th level, increase it to three extra dice.",
        "failure": ""
    },
    "Reactive Shield": {
        "type": "Reaction",
        "name": "Reactive Shield",
        "traits": [
            "Fighter"
        ],
        "cost": "",
        "requirement": "You are wielding a shield.",
        "trigger": "An enemy hits you with a melee Strike.",
        "description": "You can snap your shield into place just as you would take a blow, avoiding the hit at the last second. You immediately use the Raise a Shield action and gain your shield’s bonus to AC. The circumstance bonus from the shield applies to your AC when you’re determining the outcome of the triggering attack.",
        "failure": ""
    },
    "Snagging Strike": {
        "type": "1AP",
        "name": "Snagging Strike",
        "traits": [
            "Fighter"
        ],
        "cost": "",
        "requirement": "You have one hand free, and your target is within reach of that hand.",
        "trigger": "",
        "description": "You combine an attack with quick grappling moves to throw an enemy off balance as long as it stays in your reach. Make a Strike while keeping one hand free. If this Strike hits, the target is flat-footed until the start of your next turn or until it’s no longer within the reach of your hand, whichever comes first.",
        "failure": ""
    },
    "Sudden Charge": {
        "type": "2AP",
        "name": "Sudden Charge",
        "traits": [
            "Fighter",
            "Flourish",
            "Open"
        ],
        "cost": "",
        "requirement": "",
        "trigger": "",
        "description": "With a quick sprint, you dash up to your foe and swing. Stride twice. If you end your movement within melee reach of at least one enemy, you can make a melee Strike against that enemy. You can use Sudden Charge while Burrowing, Climbing, Flying, or Swimming instead of Striding if you have the corresponding movement type.",
        "failure": ""
    }
}